# GetProfileCurveInWorldCoordinates Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevolvedSurface..::..GetProfileCurveInWorldCoordinates Method
RevolvedSurface Class See Also
---
Returns a copy of the profile curve expressed in the world coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017_subscription_update
# Syntax
C#
---
```text
public Curve GetProfileCurveInWorldCoordinates()
```

Visual Basic
---
```text
Public Function GetProfileCurveInWorldCoordinates As Curve
```

Visual C++
---
```text
public:
Curve^ GetProfileCurveInWorldCoordinates()
```

# ### Return Value
A copy of the profile curve in the world coordinate system.
# See Also
RevolvedSurface Class
Autodesk.Revit.DB Namespace